## Titanic problem

0. Import path

In [225]:
# import os as os
import pandas as pd
import numpy as np
# import math
# import random

# from datetime import datetime
# from tqdm.notebook import tqdm 
# from scipy.stats import binom
# import matplotlib.pyplot as plt

1) load data

In [226]:
data_train = pd.read_csv('data/train.csv')

data_test = pd.read_csv('data/test.csv')

gender_submission = pd.read_csv('data/gender_submission.csv')

In [227]:
display(data_train)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [228]:
data_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [229]:
pd.DataFrame(data_train.Survived.value_counts())

   Survived
0       549
1       342

In [230]:
pd.DataFrame(data_train.Survived.value_counts(normalize=True))

   Survived
0  0.616162
1  0.383838

In [231]:
data_test.PassengerId
# data_test['Survived'] =  np.repeat(0,418)
data_test['Survived'] =  0

In [232]:
data_test.shape

(418, 12)

In [233]:
data_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,0
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,0
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,0
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,0
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,0

In [234]:
diccionario = {'PassengerId' : data_test['PassengerId'], 'Survived' : data_test['Survived']}

In [235]:
submit = pd.DataFrame(diccionario)
submit.to_csv('data/theyallperish_1.csv', index=False)

2) MUJERES

In [236]:
data_train.Sex.value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [237]:
pd.crosstab(data_train['Sex'], data_train['Survived'], normalize='all')

Survived         0         1
Sex
female    0.090909  0.261504
male      0.525253  0.122334

In [238]:
test = pd.DataFrame(data_test)

test['Survived'] = 0

test.loc[test['Sex'] == 'female', 'Survived'] = 1

display(test)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,0
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,1
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,0
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,0
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,1
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S,0
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C,1
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S,0
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S,0
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C,0

In [239]:
diccionario = {'PassengerId' : test['PassengerId'], 'Survived' : test['Survived']}
submit = pd.DataFrame(diccionario)
submit.to_csv('data/theyallperish_2.csv', index=False)

3) Edad

In [240]:
data_train['Age'].describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [241]:
train = data_train
train['Child'] = 0
train.loc[train['Age'] < 18, 'Child'] = 1

In [242]:
train.Child.fillna(1)

0      0
1      0
2      0
3      0
4      0
      ..
886    0
887    0
888    0
889    0
890    0
Name: Child, Length: 891, dtype: int64

In [243]:
train = train[['Survived', 'Child', 'Sex']]

In [244]:
result = train.groupby(['Child', 'Sex']).agg({'Survived':'sum'}).reset_index()
result

   Child     Sex  Survived
0      0  female       195
1      0    male        86
2      1  female        38
3      1    male        23

In [245]:
result = train.groupby(['Child', 'Sex']).agg({'Survived':'count'}).reset_index()
result

   Child     Sex  Survived
0      0  female       259
1      0    male       519
2      1  female        55
3      1    male        58

In [246]:
result = train.groupby(['Child', 'Sex']).agg({'Survived': lambda x: sum(x)/len(x)}).reset_index()
result

   Child     Sex  Survived
0      0  female  0.752896
1      0    male  0.165703
2      1  female  0.690909
3      1    male  0.396552

Aun considerando los casos de mayor o menor de edad, el gÃ©nero termina condicionando el resultado.

4) Clase

In [247]:
train_clase = data_train

train_clase['Fare2'] = '30+'

train_clase.loc[(train_clase['Fare'] < 30) & (train_clase['Fare'] > 20), 'Fare2'] = '20-30' 
train_clase.loc[(train_clase['Fare'] < 20) & (train_clase['Fare'] > 10), 'Fare2'] = '10-20'
train_clase.loc[(train_clase['Fare'] < 10), 'Fare2'] = '10'

In [248]:
train_clase.groupby(['Fare2', 'Pclass', 'Sex'])['Survived'].mean().reset_index()

    Fare2  Pclass     Sex  Survived
0      10       1    male  0.000000
1      10       2    male  0.000000
2      10       3  female  0.593750
3      10       3    male  0.111538
4   10-20       2  female  0.914286
5   10-20       2    male  0.158730
6   10-20       3  female  0.581395
7   10-20       3    male  0.236842
8   20-30       1  female  0.833333
9   20-30       1    male  0.400000
10  20-30       2  female  0.900000
11  20-30       2    male  0.160000
12  20-30       3  female  0.333333
13  20-30       3    male  0.125000
14    30+       1  female  0.977273
15    30+       1    male  0.383721
16    30+       2  female  1.000000
17    30+       2    male  0.214286
18    30+       3  female  0.125000
19    30+       3    male  0.240000

In [249]:
test_clase = data_test
test_clase['Survived'] = 0
test_clase.loc[test_clase['Sex'] == 'female', 'Survived'] = 1
test_clase.loc[(test_clase['Sex'] == 'female') & (test_clase['Pclass'] == 3) & (test_clase['Fare'] >= 20), 'Survived'] = 0
test_clase

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,0
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,1
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,0
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,0
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,1
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S,0
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C,1
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S,0
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S,0
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C,0

In [250]:
diccionario = {'PassengerId' : test_clase['PassengerId'], 'Survived' : test_clase['Survived']}
submit = pd.DataFrame(diccionario)
submit.to_csv('data/theyallperish_4.csv', index=False)

## Decision Trees

In [251]:
from sklearn import tree

In [252]:
model = tree.DecisionTreeClassifier()

In [253]:
data_train_sn = data_train[['Sex', 'Age', 'SibSp', 'Parch', 'Fare', 'Survived']].dropna()
X_train_sn = data_train_sn[['Sex', 'Age', 'SibSp', 'Parch', 'Fare']].replace({'male' : 0, 'female' : 1})
y_train_sn = data_train_sn.Survived

data_test_sn = data_test.dropna()
X_test_sn = data_test_sn[['Sex', 'Age', 'SibSp', 'Parch', 'Fare']].replace({'male' : 0, 'female' : 1})

In [254]:
X_train = data_train[['Sex', 'Age', 'SibSp', 'Parch', 'Fare']].replace({'male' : 0, 'female' : 1})
mean_age = X_train.Age.mean()
mean_fare = X_train.Fare.mean()
X_train['Age'] = X_train['Age'].fillna(mean_age)
# X_train.isna().sum()
y_train = data_train.Survived

X_test = data_test[['Sex', 'Age', 'SibSp', 'Parch', 'Fare']].replace({'male' : 0, 'female' : 1})
X_test['Age'] = X_test.Age.fillna(mean_age)
X_test['Fare'] = X_test.Age.fillna(mean_fare)

In [255]:
model.fit(X_train, y_train)

DecisionTreeClassifier()

In [256]:
tree_prediction = model.predict(X_test)

In [257]:
diccionario = {'PassengerId' : test['PassengerId'], 'Survived' : tree_prediction}
submit = pd.DataFrame(diccionario)
submit.to_csv('data/tree_prediction.csv', index=False)

In [258]:
## otra forma 
model = tree.DecisionTreeClassifier(max_depth=None, min_samples_split=20, min_samples_leaf=7)

In [259]:
Embarked_train = pd.get_dummies(data_train['Embarked'])

X_train = data_train[['Sex', 'Age', 'SibSp', 'Parch', 'Fare']].replace({'male' : 0, 
                                                                        'female' : 1})
X_train = pd.concat([X_train, Embarked_train], axis=1)

In [260]:
mean_age = X_train.Age.mean()
mean_fare = X_train.Fare.mean()

X_train['Age'] = X_train['Age'].fillna(mean_age)
y_train = data_train.Survived

In [261]:
Embarked_test = pd.get_dummies(data_test['Embarked'])

X_test = data_test[['Sex', 'Age', 'SibSp', 'Parch', 'Fare']].replace({'male' : 0, 
                                                                      'female' : 1})

X_test = pd.concat([X_test, Embarked_test], axis=1)

In [262]:
X_test['Age'] = X_test.Age.fillna(mean_age)
X_test['Fare'] = X_test.Age.fillna(mean_fare)

model.fit(X_train, y_train)

DecisionTreeClassifier(min_samples_leaf=7, min_samples_split=20)

In [263]:
tree_prediction = model.predict(X_test)

In [264]:
diccionario = {'PassengerId' : test['PassengerId'], 'Survived' : tree_prediction}
submit = pd.DataFrame(diccionario)
submit.to_csv('data/tree_prediction_2.csv', index=False)

### Feature Engineering

In [265]:
test_fe = data_test
train_fe = data_train

In [266]:
train_fe['Name'][0]

'Braund, Mr. Owen Harris'

In [267]:
train_fe.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'Child', 'Fare2'],
      dtype='object')

In [268]:
string_to_split = train_fe['Name'][0]
delimiter = ","
string_to_split.split(delimiter)

['Braund', ' Mr. Owen Harris']

In [269]:
'eef geg'.split()

['eef', 'geg']

In [270]:
test_fe['Survived'] =float('nan')

combi = pd.concat([train_fe, test_fe], ignore_index=True)

In [271]:
combi.Name[0]

'Braund, Mr. Owen Harris'

In [272]:
combi['Name'][0].split(',')

['Braund', ' Mr. Owen Harris']

In [273]:
combi['Name'][0].split('[,.]')

['Braund, Mr. Owen Harris']

In [275]:
import re
result = re.split('[,.]', combi['Name'][0])
result = [s.strip() for s in result]
result

['Braund', 'Mr', 'Owen Harris']

In [276]:
re.split('[,.]', combi['Name'][0])[1]

' Mr'

In [277]:
combi['Title'] = combi['Name'].apply(lambda x: re.split('[,.]', x)[1].strip() if pd.notnull(x) else None)

In [278]:
combi['Title']

0           Mr
1          Mrs
2         Miss
3          Mrs
4           Mr
         ...
1304        Mr
1305      Dona
1306        Mr
1307        Mr
1308    Master
Name: Title, Length: 1309, dtype: object

In [279]:
'a' if 2 == 2 else 'b'

'a'

In [280]:
f = lambda x: re.split('[,.]', x)[1].strip() if pd.notnull(x) else None
f

In [281]:
def g(x):
    return re.split('[,.]', x)[1].strip() if pd.notnull(x) else None
g

In [282]:
combi['Title'] = combi['Title'].str.replace(' ', '')

In [283]:
combi['Title']

0           Mr
1          Mrs
2         Miss
3          Mrs
4           Mr
         ...
1304        Mr
1305      Dona
1306        Mr
1307        Mr
1308    Master
Name: Title, Length: 1309, dtype: object

In [284]:
title_counts = combi['Title'].value_counts()
title_counts

Mr             757
Miss           260
Mrs            197
Master          61
Rev              8
Dr               8
Col              4
Mlle             2
Major            2
Ms               2
Lady             1
Sir              1
Mme              1
Don              1
Capt             1
theCountess      1
Jonkheer         1
Dona             1
Name: Title, dtype: int64

In [285]:
combi['Title'].replace(['Mme', 'Mlle'], 'Mlle', inplace=True)

In [286]:
combi['Title'].replace(['Capt', 'Don', 'Major', 'Sir'], 'Sir', inplace=True)
combi['Title'].replace(['Dona', 'Lady', 'the Countess', 'Jonkheer'], 'Lady', inplace=True)

In [287]:
combi['FamilySize'] = combi['SibSp'] + combi['Parch'] + 1

In [288]:
combi['Parch']

0       0
1       0
2       0
3       0
4       0
       ..
1304    0
1305    0
1306    0
1307    0
1308    1
Name: Parch, Length: 1309, dtype: int64

In [289]:
combi['FamilySize']

0       2
1       2
2       1
3       2
4       1
       ..
1304    1
1305    1
1306    1
1307    1
1308    3
Name: FamilySize, Length: 1309, dtype: int64

In [290]:
combi['Surname'] = combi['Name'].str.split('[,.]').str[0]

In [291]:
combi['FamilyID'] = combi['FamilySize'].astype(str) + combi['Surname']

In [292]:
combi['FamilyID']

0              2Braund
1             2Cumings
2           1Heikkinen
3            2Futrelle
4               1Allen
             ...
1304          1Spector
1305    1Oliva y Ocana
1306          1Saether
1307             1Ware
1308            3Peter
Name: FamilyID, Length: 1309, dtype: object

In [293]:
combi.loc[combi['FamilySize'] <= 2, 'FamilyID'] = 'Small'

In [294]:
title_counts = combi['FamilyID'].value_counts()
title_counts

Small             1025
11Sage              11
7Andersson           9
8Goodwin             8
7Asplund             7
                  ...
4Jacobsohn           1
3Strom               1
3Appleton            1
3Silven              1
5Kink-Heilmann       1
Name: FamilyID, Length: 97, dtype: int64

In [295]:
famIDs = pd.DataFrame(combi['FamilyID'].value_counts()).reset_index()
famIDs.columns = ['FamilyID', 'Count']

In [296]:
famIDs

          FamilyID  Count
0            Small   1025
1           11Sage     11
2       7Andersson      9
3         8Goodwin      8
4         7Asplund      7
..             ...    ...
92      4Jacobsohn      1
93          3Strom      1
94       3Appleton      1
95         3Silven      1
96  5Kink-Heilmann      1

[97 rows x 2 columns]

In [297]:
famIDs = famIDs[famIDs['Count'] <= 2]

In [298]:
combi.loc[combi['FamilyID'].isin(famIDs['FamilyID']), 'FamilyID'] = 'Small'
combi['FamilyID'] = combi['FamilyID'].astype('category')

In [299]:
train_fe = combi.iloc[:891, :]
test_fe = combi.iloc[891:1309, :]

In [303]:
model = tree.DecisionTreeClassifier(max_depth=None, min_samples_split=20, min_samples_leaf=7)

In [334]:
Embarked_train = pd.get_dummies(train_fe['Embarked'])

X_train = train_fe[['Pclass', 'Sex', 'Age', 'SibSp', 
                    'Parch', 'Fare', 'Embarked', 'Title', 
                    'FamilySize']].replace({'male' : 0, 'female' : 1, 
                                            'Mr': 1, 'Mrs': 2, 'Miss': 3, 'Master': 4, 'Sir': 5,
                                            'Rev': 6, 'Dr': 7, 'Mlle': 8, 'Ms': 9, 'Lady': 10,
                                            'Col': 11, 'theCountess': 12})

mean_age = X_train.Age.mean()
mean_fare = X_train.Fare.mean()

X_train = pd.concat([X_train, Embarked_train], axis=1)
X_train = X_train.drop('Embarked', axis=1)
X_train['Age'] = X_train['Age'].fillna(mean_age)
# X_train.isna().sum()
y_train = train_fe.Survived


#################
Embarked_test = pd.get_dummies(test_fe['Embarked'])

X_test = test_fe[['Pclass', 'Sex', 'Age', 'SibSp', 
                  'Parch', 'Fare', 'Embarked', 'Title', 
                  'FamilySize']].replace({'male' : 0, 'female' : 1,
                                          'Mr': 1, 'Mrs': 2, 'Miss': 3, 'Master': 4, 'Sir': 5,
                                          'Rev': 6, 'Dr': 7, 'Mlle': 8, 'Ms': 9, 'Lady': 10,
                                          'Col': 11, 'theCountess': 12})

X_test = pd.concat([X_test, Embarked_test], axis=1)
X_test = X_test.drop('Embarked', axis=1)
X_test['Age'] = X_test.Age.fillna(mean_age)
X_test['Fare'] = X_test.Age.fillna(mean_fare)

model.fit(X_train, y_train)
tree_prediction = model.predict(X_test)

In [350]:
diccionario = {'PassengerId' : test['PassengerId'], 'Survived' : tree_prediction}
submit = pd.DataFrame(diccionario)
submit.Survived = submit.Survived.astype('int')
submit.to_csv('data/tree_prediction_feature_engineering.csv', index=False)

In [346]:
submit.Survived = submit.Survived.astype('int')

In [349]:
submit.to_csv('data/tree_prediction_feature_engineering_op.csv', index=False)

In [345]:
pd.read_csv('data/tree_prediction.csv')

     PassengerId  Survived
0            892         0
1            893         1
2            894         0
3            895         0
4            896         1
..           ...       ...
413         1305         1
414         1306         0
415         1307         0
416         1308         1
417         1309         1

[418 rows x 2 columns]

In [134]:
diccionario = {'PassengerId' : test['PassengerId'], 'Survived' : test['Survived']}
submit = pd.DataFrame(diccionario)
submit.to_csv('data/theyallperish.csv', index=False)

### Random Forests